# Pandas(Panel Datas)

    1.  DataFrame 인덱싱과 슬라이싱 정리
|인덱싱 값|가능 여부|결과|자료형|비고|
|:---:|:---:|:---:|:---:|:---:|
label|O|열|DataFrame| |
label list|O|열|DataFrame| |
index(int)|X| | |column label이 문자인 경우는 불가능하지만 정수인 경우는 가능하다.|
slicing(int)|O|행|DataFrame| |

    2. Pandas 데이터 입출력
        2.1. 데이터 출력
            2.1.1. CSV(Comma Separated Value) : CSV파일 포맷은 데이터 값이 콤마로 구분되는 텍스트 파일임.
            2.1.2. 데이터를 csv 파일로 출력할 땐 to_csv() 메서드를 활용
            2.1.3. DataFrame의 index는 의미 없는 값이므로 출력할 때 배제함. / 기본값 인자인 index의 default가 True이니 index=False를 사용
                - data를 정의한 변수.to_csv("파일제목", index=False)
            2.1.4. DataFrame의 column index를 제거할 수 있음.
                - data를 정의한 변수.to_csv("파일제목", index=False, header=False)
            2.1.5. 콤마로 구분되지 않은 텍스트 파일에 대해서 주피터랩 매직 명령어 사용
                - %%writefile sample3.txt 
            2.1.6. sep 인수로 구분자를 바꿀수 있음
                - sep='|'
            2.1.7. 
        2.2. 데이터 입력
            2.2.1. csv 파일에서 데이터를 불러오는 것.
                - pd.read_csv("파일 제목")
            2.2.2. row 데이터가 없었으므로 새로운 row 데이터를 적용함.
            2.2.3. 콤마로 구분되지 않은 텍스트 파일 불러오기
                - pd.read_table('파일제목', sep='\s+')  / sep='\s+'(정규식 문자열) : 길이가 정해지지 않은 공백이 구분자인 경우 입력
            2.2.4. 데이터로 불러올 자료 파일 중에 건너 뛰어야 할 
            2.2.5. 데이터로 불러올 자료 안 특정한 값을 NaN으로 취급하고 싶을 때
                - na_values['인수']
        2.3. csv 파일 가져오기
            2.3.1. 앞이나 뒤의 특정 개수만 보고 싶다면 head(), tail() 메서드를 사용하면 됨.
    
    3. DataFrame 고급 인덱싱
        3.1. pandas는 (row 인덱스, column 인덱스) 형식으로 2차원 인덱싱을 지원
            3.1.1. loc :label 값 기반의 2차원 인덱싱
                - df.loc[row 인덱싱 값] --> column 생략이면, 전체 column 선택 
                - df.loc[row 인덱싱 값, column 인덱싱 값]
                - row 인덱싱 값은 정수 또는 row index 데이터, column 인덱싱 값은 label 문자열 또는 RangeIndex 형태임.
                    * index데이터, index, epdlxj tmffkdltm, index 데이터 리스트, 같은 row 인덱스를 가지는 boolean Series(row 인덱싱의 경우), 또는 위의 값들을 반환하는 함수
                - loc 인덱싱은 label(column) 인덱싱이나 label(column) 리스트 인덱싱은 불가능함.
                - row 인덱스 값이 default로 정수로 생성된 DataFrame인 경우 슬라이싱 마지막 숫자가 포함된 결과를 가져옴
                - [row 인덱스], [column 인덱스] 형태를 가짐.
            3.1.2. iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱
                - int로된 인덱스에 접근하기 때문에 슬라이싱 방식은 [이상: 미만]의 형태를 띈다. 
                - loc 인덱서와 반대로 label이 아니라 순서를 나타내는 정수 인덱스만 받음. / 다른 사항은 loc 인덱서와 같음

    4. Series 데이터 개수 세기
        4.1. count() 메서드
            4.1.1. DataFrame 객체에서 각 열마다의 데이터 개수를 세고 결과를 Series로 반환함.

    5. Series 카테고리 값 세기
        5.1. Series의 값이 정수, 문자열, 카테고리 밧인 경우에는 value_counts() 메서드로 각각의 값이 나온 횟를 셀 수 있움.
            - value_counts()
        5.2. index 기준 정렬하려면 sort_index(), value를 기준으로 정려하려면 sort_values() 메서드 사용
        5.3. 내림차순 : ascending=False 와 같은 키워드 인수를 지정하면 됨.
        5.4. DataFrame 정렬 기준이 되는 column을 지정해주어야 함. - by= 와 같은 키워드인수
    
    6. DataFrame 행/열 합계
        6.1. row와 column의 합계를 구할 때는 sum(axis) 메서드를 사용함.

In [10]:
import pandas as pd

In [12]:
data = {'c1':[1, 2, "누락"], 'c2':[1.11, " ", "3.33"], 'c3':["one", "two", "three"]}
df_data= pd.DataFrame(data=data)
df_data

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [25]:
# 2.1.2)
df_data.to_csv("sample1.csv",index=False)

In [26]:
# 2.2.1)
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [27]:
# 2.1.4)
df_data.to_csv("sample2.csv",index=False, header=False)

In [29]:
df_read2 = pd.read_csv("sample2.csv", names= ['c1','c2','c3'])
df_read2

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [30]:
# 2.1.5)
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [31]:
# 2.2.3)
pd.read_table('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [32]:
# 2.1.
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [33]:
# 2.2.4)
pd.read_csv('sample4.txt', skiprows=[0, 1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [35]:
# 2.2.5)
df_na_va1 = pd.read_csv('sample1.csv', na_values=['누락'," "])
df_na_va1

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [36]:
# 2.1.6)
df_na_va1.to_csv('sample5.txt', sep='|')

In [39]:
df_na_va1.to_csv('sample6.csv', na_rep='누락')

In [219]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")
titanic.head(10)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
5,0,male,2.0,3,1,21.0750,Third,unknown,Southampton,n
6,1,female,27.0,0,2,11.1333,Third,unknown,Southampton,n
7,1,female,14.0,1,0,30.0708,Second,unknown,Cherbourg,n
8,1,female,4.0,1,1,16.7000,Third,G,Southampton,n
9,0,male,20.0,0,0,8.0500,Third,unknown,Southampton,y

In [249]:
data1 = pd.DataFrame(np.arange(10,22).reshape(3,4), index=["a", "b", "c"], columns=["A","B","C","D"])
data1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [55]:
# 3.3.1) loc 인덱서
data1.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int64

In [56]:
# 3.3.1) loc 인덱서
data1.loc["b":"c"]  # df["b":"c"]처럼 b부터 c까지의 데이터를 가져옴.

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [58]:
# 3.3.1) loc 인덱서 리스트형태
data1.loc[["b", "c"]]   # "b"와 "c" 각각의 값을 리스트 형태로 주어져도 값을 출력해줌.

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [252]:
# 3.3.1) loc 인덱서 Boolean 타입
data1.A > 15        # A 란에는 영문자 column만 입력가능함.
data1.loc[data1.A > 15]     # True값만 출력해줌.

    A   B   C   D
c  18  19  20  21

In [63]:
# 3.3.1) loc 인덱서 함수
def select_rows(data1, num):
    return data1.A > num

select_rows(data1, 10)

a    False
b     True
c     True
Name: A, dtype: bool

In [65]:
# 3.3.1) loc 인덱서 함수
data1.loc[select_rows(data1, 10)]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [67]:
data2 = pd.DataFrame(np.arange(10,26).reshape(4,4), columns=["A", "B", "C", "D"])
data2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [68]:
data2.loc[1:2]      # label(column)기준으로 인덱싱이나 슬라이싱으로 하기 떄문에 1에서 2까지 포함한 값을 출력해줌.

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [69]:
# 3.3.1) loc 인덱서
data1.loc["a", "A"]     # [row 인덱스], [column 인덱스] 형태를 가짐.

10

In [255]:
# 3.3.1) loc 인덱서
data1.loc["b":, "A"]
data1.loc["a", :]
data1.loc[["a",'b'], ['B','D']]

    B   D
a  11  13
b  15  17

In [76]:
# 3.3.1) loc 인덱서 Boolean Series
data1.loc[data1.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [83]:
# 3.3.2) iloc 인덱서 
data1.iloc[0,1]
data1.iloc[:2, 2]
data1.iloc[0,-2:]
data.iloc[2:3, 1:3]

    B   C
c  19  20

In [86]:
# 3.3.2) iloc 인덱서 
data1.iloc[-1]
data1.iloc[-1] = data1.iloc[-1] * 2
data1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [87]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [89]:
s.count()           # count() 메서드는 NaN를 세지 않고 반환

9

In [90]:
len(s)

10

In [222]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [95]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [99]:
# 5.1)
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))      # 0~ 5 사이의 정수를 100회 생성하고 있음
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int64

In [102]:
s2.value_counts()       # 0~5 사이의 정수 별로 갯수를 세어줌

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [103]:

np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [104]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [105]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [106]:
# 5.2)
s2.value_counts().sort_index()      # 앞에 value_counts() 메서드를 먼저 진행하여 Series 카테고리 별 갯수를 세주고 index 순으로 정렬해줌.

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [108]:
# 5.2)
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [109]:
s.sort_values()     # value 별로 정렬할 때, sort_values() 메서드는 NaN 값을 가장 나중에 출력해줌.

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [110]:
# 5.3)
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [111]:
df.sort_values(by=1)        # column = 1에 값을 내림차순으로 정렬

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [112]:
df.sort_values(by=[1, 2])   # column = 1을 먼저 정렬 후 column = 2 기준으로 정렬함

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [135]:
# sex, age, class, alive의 각 인원수를 구하고 sort_values 메서드를 사용하여 내림차순으로 정렬

titanic.value_counts("sex").sort_values(ascending=False)        # titanic['sex'].value_counts().sort_values(ascending=False)
titanic.value_counts("age").sort_values(ascending=False)
titanic.value_counts("class").sort_values(ascending=False)
titanic.value_counts("alive").sort_values(ascending=False)

alive
no     549
yes    342
dtype: int64

In [134]:
titanic.value_counts("class")       # Series 형태로 행의 갯수를 세어줄 수 있음.

class
Third     491
First     216
Second    184
dtype: int64

In [129]:
df3 = pd.DataFrame(np.ones((3, 4)), columns=list("가나다라"))
df3["나"] = 2.0
df3.iloc[1,2] = 3.0
df3.iloc[2,3] = np.nan
df3

     가    나    다    라
0  1.0  2.0  1.0  1.0
1  1.0  2.0  3.0  1.0
2  1.0  2.0  1.0  NaN

In [130]:
df3.value_counts(['가', '다'])      # (가, 1.0)과 (다, 1.0)을 가지고 있는 행이 2개 있고, (가, 1.0)과 (다, 3.0)을 가지고 있는 행은 1개 있다.

가    다
1.0  1.0    2
     3.0    1
dtype: int64

In [133]:
df3.value_counts(['가', '라'])      # NaN이 있는 경우는 그 행을 제외하고 카운트를 진행함.

가    라
1.0  1.0    2
dtype: int64

In [136]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [137]:
df2.sum(axis=1)     # row의 집계

0    35
1    34
2    41
3    42
dtype: int64

In [138]:
df2["RowSum"] = df2.sum(axis=1)     # row 집계한 값을 열에 추가
df2

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [140]:
df2.loc["ColTotal"] = df2.sum()     # column별 집계한 값을 행에 추가
df2

           0   1   2   3   4   5  6   7  RowSum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

In [146]:
df2.loc["ColMean"] = df2.mean()     # row = 0, column = 1
df2

             0      1     2     3    4    5    6     7  RowSum
0         5.00   8.00   9.0  5.00  0.0  0.0  1.0  7.00   35.00
1         6.00   9.00   2.0  4.00  5.0  2.0  4.0  2.00   34.00
2         4.00   7.00   7.0  9.00  1.0  7.0  0.0  6.00   41.00
3         9.00   9.00   7.0  6.00  9.0  1.0  0.0  1.00   42.00
ColTotal  9.60  13.20  10.0  9.60  6.0  4.0  2.0  6.40   60.80
ColMean   6.72   9.24   7.0  6.72  4.2  2.8  1.4  4.48   42.56

In [223]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [242]:
# (1) 타이타닉호 승객의 평균 나이를 구하세요.
round(titanic["age"].mean(), 1)

29.7

In [240]:
# (2) 타이타닉호 승객 중 여성 승객의 평균 나이를 구하세요.
titanic_female = titanic[titanic["sex"] == "female"]        # titanic["sex"] == "female"의 bool Series는 "female"만 True 값으로 처리됨. 
titanic_female["age"].mean().round(1)

27.9

In [239]:
# (3) 타이타닉호 승객 중 1등실(pclass==1) 선실의 여생 승객의 평균 나이를 구하세요.
titanic_female[titanic_female["class"] == "First"]["age"].mean().round(1)
# titanic_female[titanic_female["pclass"] == 1]["age"].mean().round(2)

34.6

In [245]:
# (3) 타이타닉호 승객 중 1등실(pclass==1) 선실의 여생 승객의 평균 나이를 구하세요.
round(titanic[(titanic["pclass"] == 1) & (titanic['sex'] == 'female')]['age'].mean(), 1)

34.6